          "detail": "Follow the river south of the Windswept Hills fast travel statue.  Blue crystalline nodes respawn every few minutes and yield 2–4 fragments each; scoop the stray shards on the ground and focus on the gray rocks shot through with blue veins described in the official materials compendium for consistent drops.【palwiki-paldium†L42-L71】【palwiki-paldium-raw†L17-L29】",
            "palwiki-paldium",
            "palwiki-paldium-raw"
          "detail": "Circle the cliff ring northwest of the starting valley.  Surface fragments protrude from the ground and can be kicked for bonus drops, and any remaining stone piles may still cough up fragments as the wiki notes, keeping runs around ~30 shards per lap.【palwiki-paldium†L86-L115】【palwiki-paldium-raw†L21-L29】",
            "palwiki-paldium",
            "palwiki-paldium-raw"
          "detail": "Back at base, smelt spare Ore into Ingots, then crush the leftovers to convert into extra fragments.  Each smelting cycle produces 2 fragments as a by-product when using the Primitive Furnace, and the Crusher recipe turns spare Stone into fragments so you never leave empty-handed.【palwiki-paldium†L118-L140】【palwiki-paldium-raw†L23-L33】",
            "palwiki-paldium",
            "palwiki-paldium-raw"
          "detail": "Circle the grassy flats below the Palbox. Chikipi roam here constantly, lay eggs on the ground, and rarely fight back, so you can secure four layers quickly while scooping any loose ingredients you spot.【palwiki-chikipi†L1850-L1859】【palwiki-egg-raw†L19-L24】",
            "palwiki-chikipi",
            "palwiki-egg-raw"
          "detail": "Place two captured Chikipi on the Ranch. Their Egg Layer partner skill produces eggs over time, so stagger assignments to keep timers rolling and let the ranch act as the guaranteed farming source noted in the ingredient catalog.【palwiki-chikipi†L1667-L1693】【palwiki-egg-raw†L19-L28】",
            "palwiki-chikipi",
            "palwiki-egg-raw"
          "detail": "Jog a perimeter lap through the same fields, collecting freshly laid eggs and watching for respawned Chikipi to top off your ranch roster; if the ground spawns run dry, buy a few from the merchants listed in the ingredient entry to bridge timers.【palwiki-chikipi†L1850-L1859】【palwiki-egg-raw†L24-L31】",
            "palwiki-chikipi",
            "palwiki-egg-raw"
